/**
 * Created on 07.11.2018.
 *
 * @author Aleks Sidorenko (alek.sidorenko1979@gmail.com).
 * @version $Id$.
 * @since 0.1.
 */
package task_943;

/*
    Змейка - 3

    Напишите программу, которая выводит элемент из строки Y и столбца X матрицы размера N×M,
которая заполнена следующим образом:

0	1	2	3
7	6	5	4
8	9	10	11

    Входные данные
Входной файл INPUT.TXT содержит натуральные числа N, M, Y, X (Y ≤ N ≤ 50; X ≤ M ≤ 50). N - количество строк матрицы,
M - количество столбцов матрицы, Y и X - номера строки и столбца искомого элемента.

    Выходные данные
В выходной файл OUTPUT.TXT выведите искомый элемент.

    Примеры
№	INPUT.TXT	OUTPUT.TXT
1	3 4 2 3	    5
2	5 2 3 1	    4
 */