/**
 * Created on 06.12.2018.
 *
 * @author Aleks Sidorenko (alek.sidorenko1979@gmail.com).
 * @version $Id$.
 * @since 0.1.
 */
package ru.tasks.task_043;

/*
    Нули

    Требуется найти самую длинную непрерывную цепочку нулей в последовательности нулей и единиц.

    Входные данные
В единственной строке входного файла INPUT.TXT записана последовательность нулей и единиц (без пробелов).
Суммарное количество цифр от 1 до 100.

    Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести искомую длину цепочки нулей.

Пример
№	INPUT.TXT	    OUTPUT.TXT
1	00101110000110	4
 */