/**
 * Created on 21.11.2018.
 *
 * @author Aleks Sidorenko (alek.sidorenko1979@gmail.com).
 * @version $Id$.
 * @since 0.1.
 */
package task_894;

/*
    Кольцо

    Кольцо
Заданы площадь кольца и радиус внешней окружности. Требуется определить радиус внутренней окружности.

    Входные данные
Входной файл INPUT.TXT содержит два положительных вещественных числа: S и R1 – площадь кольца и радиус внешней
окружности соответственно. Радиус внешней окружности не превышает 100.

    Выходные данные
В выходной файл OUTPUT.TXT выведите радиус внутренней окружности R2 с точностью не худшей, чем 10-3.

    Пример
№	INPUT.TXT	    OUTPUT.TXT
1	50.265482 5.0	3.000
 */