/**
 * Created on 10.01.2019.
 *
 * @author Aleks Sidorenko (alek.sidorenko1979@gmail.com).
 * @version $Id$.
 * @since 0.1.
 */
package ru.tasks.task_147;

/*
    Числа Фибоначчи

Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где
a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).

Требуется найти N-е число Фибоначчи.

    Входные данные
Во входном файле INPUT.TXT записано целое число N (0 ≤ N ≤ 30).

    Выходные данные
В выходной файл OUTPUT.TXT выведите N-е число Фибоначчи.

    Пример
№	INPUT.TXT	OUTPUT.TXT
1	7	        13
 */