/**
 * Created on 24.09.2018.
 *
 * @author Aleks Sidorenko (alek.sidorenko1979@gmail.com).
 * @version $Id$.
 * @since 0.1.
 */
package task_822;

/*
    Площадь треугольника

По целочисленным координатам вершин треугольника (x1,y1), (x2,y2) и (x3,y3) требуется вычислить его площадь.

    Входные данные
Входной файл INPUT.TXT содержит 6 целых чисел x1,y1,x2,y2,x3,y3 – координаты вершин треугольника.
Все числа не превышают 106 по абсолютной величине.

    Выходные данные
В выходной файл OUTPUT.TXT выведите точное значение площади заданного треугольника.

Примеры
№	INPUT.TXT	            OUTPUT.TXT
    x1 y1 x2 y2 x3 y3
1	2  1  2  4  6  1	    6
2	0  0  0  3  3  0	    4.5
 */